tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "gittower/tap"
tap "jackielii/tap"
tap "kdash-rs/kdash"
tap "osx-cross/arm"
brew "libgit2"
brew "bat"
brew "btop"
brew "chafa"
brew "container"
brew "sqlite"
brew "difftastic"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "ffmpeg-full"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghcup"
brew "ghidra"
brew "git"
brew "gitnr"
brew "pinentry"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "python@3.14"
brew "llvm"
brew "lua"
brew "luarocks"
brew "macmon"
brew "make"
brew "openjdk"
brew "maven"
brew "media-info"
brew "mpv"
brew "navi"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "numpy"
brew "p7zip"
brew "pinentry-mac"
brew "pipes-sh"
brew "python@3.13"
brew "pipx"
brew "poetry"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "pyinstaller"
brew "python@3.12"
brew "resvg"
brew "ripgrep"
brew "rustup"
brew "scipy"
brew "spoofdpi"
brew "switchaudio-osx"
brew "tccutil"
brew "thefuck"
brew "tlrc"
brew "tre-command"
brew "tree-sitter-cli"
brew "tty-clock"
brew "unar"
brew "uv"
brew "wget"
brew "xclip"
brew "xsel"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"
brew "asmvik/formulae/yabai", args: ["HEAD"]
brew "felixkratz/formulae/borders", args: ["HEAD"]
brew "felixkratz/formulae/sketchybar"
brew "gittower/tap/git-flow-next"
brew "jackielii/tap/skhd-zig"
brew "kdash-rs/kdash/kdash"
brew "osx-cross/arm/arm-gcc-bin@10"
cask "arc"
cask "claude"
cask "cloudflare-warp"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "docker-desktop"
cask "font-comfortaa"
cask "font-exo"
cask "font-jetbrains-mono-nerd-font"
cask "font-montserrat"
cask "font-raleway"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-serif-4"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "jordanbaird-ice@beta"
cask "keycastr"
cask "kicad"
cask "kitty"
cask "knockknock"
cask "krita"
cask "libreoffice"
cask "macs-fan-control"
cask "mactex"
cask "mos@beta"
cask "obsidian"
cask "ollama-app"
cask "pearcleaner"
cask "protonvpn"
cask "raycast"
cask "sf-symbols"
cask "skim"
cask "whisky"
cask "wireshark-app"
cask "zen"
